Adnat-Rails/app/controllers/organizations_controller.rb

  def create
    @organization = Organization.create(org_params)
    if @organization.save
      User.update(current_user.id, organization_id: @organization.id)
---
INSERT INTO "organizations" ("name", "hourly_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test 1"], ["hourly_rate", "10.0"], ["created_at", "2022-03-21 17:32:09.176188"], ["updated_at", "2022-03-21 17:32:09.176188"]]
UPDATE "users" SET "organization_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["organization_id", 2], ["updated_at", "2022-03-21 17:33:35.415638"], ["id", 1]]

  def edit
    @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    Organization.destroy(params[:id])
---
DELETE FROM "organizations" WHERE "organizations"."id" = $1  [["id", 3]]