Adnat-Rails/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(:email, params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test2.com"], ["LIMIT", 1]]

  def overview
    if current_user.organization_id == nil
      @organization= Organization.find(current_user.organization_id)
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]