Adnat-Rails/app/controllers/shifts_controller.rb

  def create
    date = shift_params[:date]
    start_time = get_date_time(date, shift_params[:start])
    finish_time = get_date_time(date, shift_params[:finish])
    @shift = Shift.create(
      user_id: current_user.id,
      start: start_time,
      finish: finish_time,
      break_length: shift_params[:break_length]
    )
---
INSERT INTO "shifts" ("start", "finish", "break_length", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start", "2022-03-21 10:39:00"], ["finish", "2022-03-21 00:39:00"], ["break_length", 0], ["user_id", 1], ["created_at", "2022-03-21 17:39:58.389277"], ["updated_at", "2022-03-21 17:39:58.389277"]]

  def edit
    @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    date = shift_params[:date]
    start_time = get_date_time(date, shift_params[:start])
    finish_time = get_date_time(date, shift_params[:finish])
    @shift = Shift.update(
      params[:id],
      start: start_time,
      finish: finish_time,
      break_length: shift_params[:break_length]
    )
---
UPDATE "shifts" SET "break_length" = $1, "updated_at" = $2 WHERE "shifts"."id" = $3  [["break_length", 10], ["updated_at", "2022-03-21 17:45:04.790584"], ["id", 1]]

  def destroy
    Shift.destroy(params[:id])
---
DELETE FROM "shifts" WHERE "shifts"."id" = $1  [["id", 2]]

  def shift_details
    @names = {}
    @hours_worked = {}
    @shift_costs = {}
    @organization = Organization.find(current_user.organization_id)

    # query shifts for current org
    @shifts = Shift
      .includes(:user)
      .where(users: {organization_id: current_user.organization_id})
      .order(start: :asc)

    # iterate through shifts in current org
    @shifts.each do |shift|
      break_l = Float(shift.break_length) / 60
      shift_duration = get_shift_duration(shift.start, shift.finish)
      hours_worked = shift_duration - break_l
      shift_cost = get_shift_cost(shift.start, shift.finish, hours_worked, @organization.hourly_rate, break_l)
      @names[shift] = User.find(shift.user_id).names
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]