Adnat-Rails/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.create(user_params)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "organization_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["organization_id", 2], ["updated_at", "2022-03-21 17:33:40.735715"], ["id", 1]]
---
  def join_org
    @organization = Organization.find(params[:id])
    User.update(current_user.id, organization_id: @organization.id)

UPDATE "users" SET "organization_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["organization_id", nil], ["updated_at", "2022-03-21 17:33:39.061244"], ["id", 1]]
---
  def leave_org
    User.update(current_user.id, organization_id: nil)