Adnat-Rails/app/views/sessions/welcome.html.erb

<ul class="org-list">
  <% for org in Organization.order(created_at: :desc).all %>
---
SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."created_at" DESC